In [4]:
import pandas as pd
import numpy as np
import seaborn as sb
import os

In [7]:
CWD = os.getcwd() # directory of the notebook
ROOT,_ = os.path.split(CWD) # root folder of the project 
DATA_DIR = os.path.join(ROOT,'raw_data')
DATA_PATH = os.path.join(DATA_DIR, 'train_data.csv')

# Project root path on your machine
print "Root location: {}".format(ROOT)

Root location: /Users/evanderknaap/Documents/Projects/tfvalidate

In [ ]:
# Lets load some train data into a dataframe
df = pd.read_csv(DATA_PATH, 
                 names=['FirstPrice', 'ThisYear', 'Mileage','City','TheState','Vin','TheMake','Model'],skiprows=1, 
                 index_col=['TheMake','Model'])
# Skip the original headers, add your own, and make a multi-hierarchal index.  

df.head(5)

In [15]:
df.describe()

               Price           Year       Mileage
count  681842.000000  681842.000000  6.818420e+05
mean    21463.763662    2013.287977  5.251436e+04
std     13536.452685       3.414858  4.210384e+04
min      1500.000000    1997.000000  5.000000e+00
25%     13030.000000    2012.000000  2.382825e+04
50%     18500.000000    2014.000000  4.025300e+04
75%     26995.000000    2016.000000  7.218200e+04
max    499500.000000    2018.000000  2.856196e+06

In [31]:
cols = df[['Price','Year','Mileage']] # result is another DF

In [32]:
cols.head(5)

   Price  Year  Mileage
0   8995  2014    35725
1  10888  2013    19606
2   8995  2013    48851
3  10999  2014    39922
4  14799  2016    22142

In [53]:
price = df['Price'] # This is a view on the underlying data - not a copy
price.head(5)

0     8995
1    10888
2     8995
3    10999
4    14799
Name: Price, dtype: int64

In [54]:
# Add a column to our dataframe, assign a range with unit step
df['American'] = 0
df['Amaerican'] = np.arange(df['Price'].size)

In [55]:
df.head(5)

,Price,Year,Mileage,City,State,Vin,Make,Model,American,Amaerican
0,8995,2014,35725,El Paso,TX,19VDE2E53EE000083,Acura,ILX6-Speed,0,0
1,10888,2013,19606,Long Island City,NY,19VDE1F52DE012636,Acura,ILX5-Speed,0,1
2,8995,2013,48851,El Paso,TX,19VDE2E52DE000025,Acura,ILX6-Speed,0,2
3,10999,2014,39922,Windsor,CO,19VDE1F71EE003817,Acura,ILX5-Speed,0,3
4,14799,2016,22142,Lindon,UT,19UDE2F32GA001284,Acura,ILXAutomatic,0,4

In [56]:
price = np.arange(df['Price'].size)

In [106]:
headers = df.columns # returns the index object for the headers 
row_index = df.index # returns the row index of a df 

# Do some simple check 
filter_up = row_index < 5 # select row where index is smaller than 5
df[filter_up]

# filter on a column 
filter_state = df['State'] == 'NY' # returns a Series with the same index 
df[filter_state.values] # can filter using a boolean array 

# Now lets create a tiny dataframe by copying some values 
df_small = df.head(5).copy()

# Next, we create a new index from the Vin numbers 
new_index = df_small['Vin'].values

In [123]:
# Next we drop the 'Vin' from our columns  
new_small_df = df_small.drop(['Vin','State','Amaerican','American'], axis = 1) # this will creata a new dataframe
new_small_df

   Price  Year  Mileage              City   Make         Model
0   8995  2014    35725           El Paso  Acura    ILX6-Speed
1  10888  2013    19606  Long Island City  Acura    ILX5-Speed
2   8995  2013    48851           El Paso  Acura    ILX6-Speed
3  10999  2014    39922           Windsor  Acura    ILX5-Speed
4  14799  2016    22142            Lindon  Acura  ILXAutomatic

In [130]:
# Lets do some slicing 
new_small_df[:2] # select the first two rows

   Price  Year  Mileage              City   Make       Model
0   8995  2014    35725           El Paso  Acura  ILX6-Speed
1  10888  2013    19606  Long Island City  Acura  ILX5-Speed

In [141]:
# Boolean slicing 
new_small_df[new_small_df['City'] == 'El Paso']

   Price  Year  Mileage     City   Make       Model
0   8995  2014    35725  El Paso  Acura  ILX6-Speed
2   8995  2013    48851  El Paso  Acura  ILX6-Speed

In [142]:
new_small_df[['City','Model']] == 'El Paso' # Create a boolean filter

    City  Model
0   True  False
1  False  False
2   True  False
3  False  False
4  False  False

In [144]:
new_small_df.ix[[0,3],'Price']

/Users/evanderknaap/Documents/Projects/tfvalidate/dataplay/lib/python2.7/site-packages/ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

0     8995
3    10999
Name: Price, dtype: int64

In [150]:
new_small_df.iloc[0:1,2:2] # row x column based on range

Empty DataFrame
Columns: []
Index: [0]

In [152]:
# Element wise operations on a dataframe 
np.abs(new_small_df[['Price','Year']])

   Price  Year
0   8995  2014
1  10888  2013
2   8995  2013
3  10999  2014
4  14799  2016

In [157]:
# Count, lets see what this does 
np.max(new_small_df)

f = lambda x: x / 1000
new_small_df['Price_normalized'] = new_small_df['Price'].apply(f)

new_small_df.head()

,Price,Year,Mileage,City,Make,Model,Price_normalized
0,8995,2014,35725,El Paso,Acura,ILX6-Speed,8
1,10888,2013,19606,Long Island City,Acura,ILX5-Speed,10
2,8995,2013,48851,El Paso,Acura,ILX6-Speed,8
3,10999,2014,39922,Windsor,Acura,ILX5-Speed,10
4,14799,2016,22142,Lindon,Acura,ILXAutomatic,14

In [159]:
# Now sort on normalized_price 
new_small_df.sort_values(['Price_normalized'], ascending = False)

,Price,Year,Mileage,City,Make,Model,Price_normalized
4,14799,2016,22142,Lindon,Acura,ILXAutomatic,14
1,10888,2013,19606,Long Island City,Acura,ILX5-Speed,10
3,10999,2014,39922,Windsor,Acura,ILX5-Speed,10
0,8995,2014,35725,El Paso,Acura,ILX6-Speed,8
2,8995,2013,48851,El Paso,Acura,ILX6-Speed,8

In [162]:
# Now sort Alphabetically the City, to find duplicates 
new_small_df.sort_values(by = ['City','Model'])

,Price,Year,Mileage,City,Make,Model,Price_normalized
0,8995,2014,35725,El Paso,Acura,ILX6-Speed,8
2,8995,2013,48851,El Paso,Acura,ILX6-Speed,8
4,14799,2016,22142,Lindon,Acura,ILXAutomatic,14
1,10888,2013,19606,Long Island City,Acura,ILX5-Speed,10
3,10999,2014,39922,Windsor,Acura,ILX5-Speed,10

In [164]:
new_small_df.sort_values(by=['City','Mileage'], ascending=False)

,Price,Year,Mileage,City,Make,Model,Price_normalized
3,10999,2014,39922,Windsor,Acura,ILX5-Speed,10
1,10888,2013,19606,Long Island City,Acura,ILX5-Speed,10
4,14799,2016,22142,Lindon,Acura,ILXAutomatic,14
2,8995,2013,48851,El Paso,Acura,ILX6-Speed,8
0,8995,2014,35725,El Paso,Acura,ILX6-Speed,8

In [165]:
# Lets take the original DataFrame, and check the size 
df['Vin'].size

681842

In [228]:
# Make sure the size is correct, else stop running the programming 
assert df['Vin'].size == df['Price'].size 

# Fetch the Vins from the thingie 
new_index = df['Vin'].values 

# Set the index to this vin index, having duplicates 
df2 = df.set_index(new_index) # Makes a copy!

# CHeckk if indeed still the same size 
assert df['Vin'].size == df2['Vin'].size

# Get the duplicates 
dups = df2.index.get_duplicates()
duplicates = df2.index.duplicated(keep='first') # boolean, selecting all rows where its the first duplicate 
not_duplicates = ~duplicates
df3 = df2[not_duplicates]

df3.loc['2G1FB1E32F9284364'] # Now if we check one of the Vin numbers, it checks out. Only one is still present.

/Users/evanderknaap/Documents/Projects/tfvalidate/dataplay/lib/python2.7/site-packages/ipykernel_launcher.py:14: FutureWarning: 'get_duplicates' is deprecated and will be removed in a future release. You can use idx[idx.duplicated()].unique() instead

Price                    16288
Year                      2015
Mileage                  54545
City                 Pensacola
State                       NY
Vin          2G1FB1E32F9284364
Make                 Chevrolet
Model              CamaroCoupe
American                     0
Amaerican                96733
Name: 2G1FB1E32F9284364, dtype: object

In [265]:
# Now lets make an hierarchy of indexes Lets index on Make and model 
make_index = df2['Make']
model_index = df2['Model']

df4 = df2.set_index([make_index, model_index])
df4.sort_index().head(15)

              Price  Year  Mileage            City State                Vin  \
Make Model
AM   General  39795  1999    93865    Indianapolis    NY  137ZA8933XE185788
     General  46795  2000    64142     South River    NY  137ZA8430YE186213
     General  48900  2000    73204  Fredericksburg    NY  137ZA9038YE186407
     General  54990  1997    26201          Denver    NY  137ZA8430VE176017
     General  49999  1998   118000          Newnan    NY  137ZA8439WE180326
     General  56400  1999    61824     Bentonville    NY  137ZA843XXE184564
     General  67000  2001    24168      Rapid City    NY  137FA90341E195713
     General  67995  2001    28269     Wilsonville    NY  137FA90331E195881
     General  61998  2001    92060         Addison    NY  137ZA843X1E193109
     General  59995  2000   113814           Tampa    NY  137ZA8439YE187635
     General  64000  2000    77274        Falmouth    NY  137ZA903XYE190006
     General  65999  1997    52201      Costa Mesa    NY  137ZA8338VE175666
     General  69995  2000    35917       San Diego    NY  137ZA8435YE189947
     General  68988  1997    75640          Deland    NY  137ZA843XVE178583
     General  65927  2000    24381      New Canaan    NY  137ZA9035YE187966

             Make    Model  American  Amaerican
Make Model
AM   General   AM  General         0       8894
     General   AM  General         0       8895
     General   AM  General         0       8896
     General   AM  General         0       8897
     General   AM  General         0       8898
     General   AM  General         0       8899
     General   AM  General         0       8900
     General   AM  General         0       8901
     General   AM  General         0       8902
     General   AM  General         0       8903
     General   AM  General         0       8904
     General   AM  General         0       8905
     General   AM  General         0       8906
     General   AM  General         0       8907
     General   AM  General         0       8908

In [346]:
# Lets select only the Ford cars 
df4.sort_index(ascending=False).head(10)

                  Price  Year  Mileage        City State                Vin  \
Make  Model
smart fortwopure   6880  2014     7527     Killeen    NY  WMEEJ3BA8EK764170
      fortwopure   5999  2014     9479   Texarkana    NY  WMEEJ3BAXEK753641
      fortwopure   6199  2014     8412  Shreveport    NY  WMEEJ3BA6EK753099
      fortwopure   6199  2014     9684  Shreveport    NY  WMEEJ3BA8EK737647
      fortwopure   6199  2014     9800  Shreveport    NY  WMEEJ3BA6EK749330
      fortwopure   6199  2014     9800  Shreveport    NY  WMEEJ3BA6EK738487
      fortwopure   6199  2014     9800  Shreveport    NY  WMEEJ3BA6EK753247
      fortwopure   6199  2014    10070  Shreveport    NY  WMEEJ3BA5EK734303
      fortwopure   6199  2014    10101  Shreveport    NY  WMEEJ3BA8EK737969
      fortwopure   6499  2014     9389      Peoria    NY  WMEEJ3BA8EK733484

                   Make       Model  American  Amaerican
Make  Model
smart fortwopure  smart  fortwopure         0     582730
      fortwopure  smart  fortwopure         0     582748
      fortwopure  smart  fortwopure         0     582754
      fortwopure  smart  fortwopure         0     582757
      fortwopure  smart  fortwopure         0     582760
      fortwopure  smart  fortwopure         0     582761
      fortwopure  smart  fortwopure         0     582762
      fortwopure  smart  fortwopure         0     582764
      fortwopure  smart  fortwopure         0     582766
      fortwopure  smart  fortwopure         0     582769

In [347]:
df4.loc[['Ford'],['Price','Year']]

                      Price  Year
Make Model
Ford Taurus            5900  2008
     Taurus            7995  2008
     Focus             9339  2013
     Focus             8775  2013
     Taurus            9885  2008
     Focus            10995  2014
     Focus             9480  2012
     Taurus            4995  2008
     Taurus           11990  2008
     Focus            12998  2015
     Focus            11997  2014
     Taurus            8995  2008
     Focus             9195  2013
     Taurus            7995  2008
     Taurus            8995  2008
     Focus            11995  2014
     Focus            10999  2014
     Focus            11498  2014
     Taurus            6995  2008
     Focus            11000  2014
     Focus            11593  2014
     Focus            10224  2014
     Focus            10554  2014
     Focus            13830  2016
     Focus            11000  2014
     Focus            10961  2014
     Focus            11500  2014
     Focus            10500  2014
     Focus            12980  2014
     Focus             8500  2012
...                     ...   ...
     Super            98980  2017
     Super            98990  2017
     MustangShelby   104950  2017
     EscapeSE         99997  2014
     F-1502WD          2900  1997
     F-1504WD         19000  2007
     Mustang2dr      109990  2009
     Explorer4WD      99999  2016
     FocusSedan       99999  2016
     FocusSedan       99995  2016
     FusionSE        113992  2014
     FocusHatchback   99999  2016
     Super           109980  2017
     FocusSedan       99999  2016
     FocusSedan       99999  2016
     Focus4dr          8995  2012
     Super           109980  2017
     F-1502WD         99999  1999
     Super           125980  2017
     Super           126982  2017
     Super           126980  2017
     Super           128980  2017
     ExplorerRWD       5991  2010
     Super            16995  2005
     F-1504WD         14995  2006
     GT2dr           279888  2005
     GT2dr           299800  2006
     GT2dr           299999  2005
     GT2dr           299000  2005
     GT2dr           399888  2006

[88097 rows x 2 columns]